Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/edc/PIC32MZ2025DAG169.PIC
      <edc:AdjustPoint edc:_addr="0x1F8EAA40" edc:offset="0x5c0"/>
      <edc:SFRDef edc:_addr="0x1F8EB000" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-EIP-00183_gfx_gc200_accel_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GPUBASEADDR" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GPUBASEADDR" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:baseofperipheral="GPU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0"/>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8EB004" edc:offset="0xffc"/>
      <edc:AdjustPoint edc:_addr="0x1F8EC000" edc:_begin="0x0" edc:_end="0x10" edc:_modsrc="DOS-EIP-00187_emb_sdio_v1.Module" edc:_refcount="1" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x1F8EC004" edc:_begin="0x0" edc:_end="0x10" edc:_modsrc="DOS-EIP-00187_emb_sdio_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnn------nnnnnnnnnn" edc:cname="SDHCBLKCON" edc:desc="" edc:impl="0xffff03ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000------0000000000" edc:name="SDHCBLKCON" edc:nzwidth="32" edc:por="0000000000000000------0000000000" ltx:baseofperipheral="SDHC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BSIZE" edc:desc="" edc:mask="0x3ff" edc:name="BLKSIZE" edc:nzwidth="10"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="BCOUNT" edc:desc="" edc:mask="0xffff" edc:name="BLKCNT" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EC008" edc:_begin="0x0" edc:_end="0x10" edc:_modsrc="DOS-EIP-00187_emb_sdio_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SDHCARG" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="SDHCARG" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SDHC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ARG" edc:desc="" edc:mask="0xffffffff" edc:name="ARG" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EC00C" edc:_begin="0x0" edc:_end="0x10" edc:_modsrc="DOS-EIP-00187_emb_sdio_v1.Module" edc:_refcount="1" edc:access="--nnnnnnnnnnn-nn----------nnnnnn" edc:cname="SDHCMODE" edc:desc="" edc:impl="0x3ffb003f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--00000000000-00----------000000" edc:name="SDHCMODE" edc:nzwidth="32" edc:por="--00000000000-00----------000000" ltx:memberofperipheral="SDHC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMAEN" edc:desc="" edc:mask="0x1" edc:name="DMAEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BCEN" edc:desc="" edc:mask="0x1" edc:name="BCEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ACEN" edc:desc="" edc:mask="0x3" edc:name="ACEN" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DTXDSEL" edc:desc="" edc:mask="0x1" edc:name="DTXDIRSEL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BSEL" edc:desc="" edc:mask="0x1" edc:name="BSEL" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="10"/>
            <edc:SFRFieldDef edc:cname="RESPTYPE" edc:desc="" edc:mask="0x3" edc:name="RESPTYPE" edc:nzwidth="2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CCRCCEN" edc:desc="" edc:mask="0x1" edc:name="CCRCCEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CIDXCEN" edc:desc="" edc:mask="0x1" edc:name="CIDXCEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DPSEL" edc:desc="" edc:mask="0x1" edc:name="DPRESSEL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CTYPE" edc:desc="" edc:mask="0x3" edc:name="CTYPE" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CIDX" edc:desc="" edc:mask="0x3f" edc:name="CIDX" edc:nzwidth="6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EC010" edc:_begin="0x10" edc:_end="0x14" edc:_modsrc="DOS-EIP-00187_emb_sdio_v1.Module" edc:_refcount="2" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="SDHCRESP0" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="RESPONSE_REGISTER0_1" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RESP" edc:desc="" edc:mask="0xffffffff" edc:name="RESP" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EC014" edc:_begin="0x10" edc:_end="0x14" edc:_modsrc="DOS-EIP-00187_emb_sdio_v1.Module" edc:_refcount="3" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="SDHCRESP1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="RESPONSE_REGISTER0_1" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SDHC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RESP" edc:desc="" edc:mask="0xffffffff" edc:name="RESP" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EC018" edc:_begin="0x10" edc:_end="0x14" edc:_modsrc="DOS-EIP-00187_emb_sdio_v1.Module" edc:_refcount="4" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="SDHCRESP2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="RESPONSE_REGISTER0_1" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RESP" edc:desc="" edc:mask="0xffffffff" edc:name="RESP" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EC01C" edc:_begin="0x10" edc:_end="0x14" edc:_modsrc="DOS-EIP-00187_emb_sdio_v1.Module" edc:_refcount="5" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="SDHCRESP3" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="RESPONSE_REGISTER0_1" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RESP" edc:desc="" edc:mask="0xffffffff" edc:name="RESP" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EC020" edc:_begin="0x14" edc:_end="0x50" edc:_modsrc="DOS-EIP-00187_emb_sdio_v1.Module" edc:_refcount="6" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SDHCDATA" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="SDHCDATA" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SDHC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="" edc:mask="0xffffffff" edc:name="DATA" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EC024" edc:_begin="0x14" edc:_end="0x50" edc:_modsrc="DOS-EIP-00187_emb_sdio_v1.Module" edc:_refcount="6" edc:access="-------rrrrrrrrr----rrrr-----rrr" edc:cname="SDHCSTAT1" edc:desc="" edc:impl="0x01ff0f07" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------xxxxxxxxx----0000-----000" edc:name="SDHCSTAT1" edc:nzwidth="32" edc:por="-------xxxxxxxxx----0000-----000" ltx:memberofperipheral="SDHC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CINHCMD" edc:desc="" edc:mask="0x1" edc:name="CINHCMD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CINHDAT" edc:desc="" edc:mask="0x1" edc:name="CINHDAT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DLACTIVE" edc:desc="" edc:mask="0x1" edc:name="DLACTIVE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="WRACTIVE" edc:desc="" edc:mask="0x1" edc:name="WRACTIVE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RDACTIVE" edc:desc="" edc:mask="0x1" edc:name="RDACTIVE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BWEN" edc:desc="" edc:mask="0x1" edc:name="BWEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BREN" edc:desc="" edc:mask="0x1" edc:name="BREN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="CARDINS" edc:desc="" edc:mask="0x1" edc:name="CARDINS" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CARDST" edc:desc="" edc:mask="0x1" edc:name="CARDST" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CDSLVL" edc:desc="" edc:mask="0x1" edc:name="CDSLVL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="WPSLVL" edc:desc="" edc:mask="0x1" edc:name="WPSLVL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DATA0SLVL" edc:desc="" edc:mask="0x1" edc:name="DATA0SLVL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DATA1SLVL" edc:desc="" edc:mask="0x1" edc:name="DATA1SLVL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DATA2SLVL" edc:desc="" edc:mask="0x1" edc:name="DATA2SLVL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DATA3SLVL" edc:desc="" edc:mask="0x1" edc:name="DATA3SLVL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CMDSLVL" edc:desc="" edc:mask="0x1" edc:name="CMDSLVL" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
